Catalogs/Р_ВходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Р_ВходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработаноСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗагруженныхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокПовторнойОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Р_ТипыВходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодпискиНаОчередиСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПотока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Р_ВходящиеСообщения/Ext/ManagerModule.bsl
Процедура ДобавитьПараметрыВСообщение(СообщениеОбъект, СтруктураПараметров) Экспорт
	
	Если Не ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Возврат;	
	КонецЕсли;  
	
	Если СтруктураПараметров.Свойство("headers") Тогда
		
		Для каждого Парам Из СтруктураПараметров.headers Цикл
			
			НСтр = СообщениеОбъект.Параметры.Добавить();
			НСтр.Имя = Парам.Ключ;
			НСтр.Значение = Парам.Значение;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаписатьОшибкуПоВходящемуСообщению(ВходящееСообщение, ТекстОшибки) Экспорт
	
	Если Не ЗначениеЗаполнено(ВходящееСообщение) Тогда
		Возврат;
	КонецЕсли;                                 
	
	ВходящееСообщениеОбъект = ВходящееСообщение.ПолучитьОбъект();  
	
	Если ВходящееСообщениеОбъект.ОбработаноСОшибкой Тогда
		ВходящееСообщениеОбъект.КоличествоПопытокПовторнойОбработки = ВходящееСообщениеОбъект.КоличествоПопытокПовторнойОбработки + 1;	
	КонецЕсли;
	
	ВходящееСообщениеОбъект.ОбработаноСОшибкой = Истина;
	ВходящееСообщениеОбъект.Обработано = Истина; 
	ВходящееСообщениеОбъект.ТекстОшибки = ТекстОшибки;
	ВходящееСообщениеОбъект.Записать();	
		
КонецПроцедуры

Процедура ПометитьВходящееОбработанным(ВходящееСообщение) Экспорт
	
	Если Не ЗначениеЗаполнено(ВходящееСообщение) Тогда
		Возврат;
	КонецЕсли;                                 
	
	ВходящееСообщениеОбъект = ВходящееСообщение.ПолучитьОбъект();
	ВходящееСообщениеОбъект.ОбработаноСОшибкой = Ложь;
	ВходящееСообщениеОбъект.Обработано = Истина;
	ВходящееСообщениеОбъект.ТекстОшибки = "";
	ВходящееСообщениеОбъект.Записать();	
		
КонецПроцедуры

Процедура ЗаписатьОшибкуБезУстановкиПометок(ВходящееСообщение, ТекстОшибки) Экспорт
	
	//+Сёмин Р.И. 09.06.2026 #UT10-5900
	Если Не ЗначениеЗаполнено(ВходящееСообщение) Тогда
		Возврат;
	КонецЕсли;                                 
	
	ВходящееСообщениеОбъект = ВходящееСообщение.ПолучитьОбъект();  
	
	ВходящееСообщениеОбъект.ОбработаноСОшибкой = Ложь;
	ВходящееСообщениеОбъект.Обработано = Ложь; 
	ВходящееСообщениеОбъект.ТекстОшибки = ТекстОшибки;
	ВходящееСообщениеОбъект.Записать();	
	//-Сёмин Р.И. 09.06.2026 #UT10-5900
	
КонецПроцедуры

Функция ПолучитьСтруктуруСвойствПоВходящемуСообщению(ВходящееСообщение) Экспорт 
	
	СвойстваСообщения = Новый Структура;
	Соответствие = Новый Соответствие;   
	
	Для каждого Парам Из ВходящееСообщение.Параметры Цикл  			
		Соответствие.Вставить(Парам.Имя, Парам.Значение);  			
	КонецЦикла; 
	
	СвойстваСообщения.Вставить("headers", Соответствие);
	
	Возврат СвойстваСообщения;
		
КонецФункции          

Функция ПолучитьВидДокументаИзПараметров(ВходящееСообщение) Экспорт
	
	//+Шульман А. 02.07.2025 #UT10-5329
	тзСтрока = ВходящееСообщение.Параметры.Найти("document_type", "Имя");
	
	Если тзСтрока = Неопределено Тогда   
		тзСтрока = ВходящееСообщение.Параметры.Найти("doc_type", "Имя");  
	КонецЕсли;
	
	Если Не тзСтрока = Неопределено Тогда   
		Возврат тзСтрока.Значение;
	КонецЕсли;
	
    Возврат ""; 
	//-Шульман А. 02.07.2025 #UT10-5329
	
КонецФункции // ()
